app/controllers/application_controller.rb

SELECT * FROM "users" WHERE ( ("users"."type" = 'Doctor' ) ) ORDER BY users.id DESC LIMIT 1
---
  def find_path
    if session[:current_user].present?