app/controllers/doctors_controller.rb

SELECT * FROM "appointments" WHERE (((status = 't') AND ("appointments".doctor_id = 3)) AND ("appointments".doctor_id = 3))
---
	def new
      @appointments = @current_user.appointments.active.all(:include => :patient)

SELECT * FROM "appointments" WHERE (date(appointment_data)='2020-05-29') AND (((status = 't') AND ("appointments".doctor_id = 3)) AND ("appointments".doctor_id = 3))
---
  def find_appointment
      if params[:datetimepicker].present?
        @appointments = @current_user.appointments.active.all(:include=>:patient,:conditions=>["date(appointment_data)=?",params[:datetimepicker].to_date])

INSERT INTO "prescriptions" ("tests_recommended", "followup_schedule", "comments", "appointment_id", "medicines_prescribed", "updated_at", "created_at") VALUES('test-recommeded', 'daily', 'nothing', NULL, 'prescribed', '2020-05-27 06:36:48', '2020-05-27 06:36:48')
---
	def create
      @prescription = Prescription.create_prescription(params)