app/controllers/patients_controller.rb

SELECT * FROM "departments"
---
    def new
   	    @doctors = Doctor.all
   	    @departments = Department.all

SELECT * FROM "departments" WHERE ("departments"."id" = '1') LIMIT 1
---
    def update_department
       	@department = Department.find_by_id(params[:department_id])

INSERT INTO "appointments" ("updated_at", "patient_id", "appointment_id", "created_at", "doctor_id", "status", "appointment_data") VALUES('2020-05-24 06:57:53', 10, 'kk122J', '2020-05-24 06:57:53', 2, 't', '2020-05-24 06:57:53')
---
    def book_appointment
    	  @appointment = Appointment.create_new_appointment(@name,params,@current_user)

SELECT * FROM "appointments" WHERE (((appointment_data >= '2020-05-27' AND status = 't') AND ("appointments".patient_id = 4)) AND ("appointments".patient_id = 4))
---
    def appointment_cancel
        @appointments = @current_user.appointments.active.all(:include=>:doctor)

SELECT "appointments".id FROM "appointments" WHERE ("appointments"."appointment_id" = '7jVD' AND "appointments".id <> 11) LIMIT 1
---
    def destroy
        @appointment = Appointment.find_by_id(params[:id])

SELECT * FROM "appointments" WHERE ("appointments".patient_id = 4)
SELECT * FROM "prescriptions" WHERE (appointment_id in (11))
---
    def prescription_list
        @prescriptions = Prescription.all :include =>{:appointment =>[:doctor,:patient]},:conditions=>['appointment_id in (?)',@current_user.appointments.collect(&:id)]

SELECT * FROM "prescriptions" WHERE ("prescriptions"."id" = '10') LIMIT 1
---
    def prescription_view
      @prescription = Prescription.find_by_id(params[:id])