app/controllers/users_controller.rb

    def create
        @user = User.create_user(params)
        if @user.present?
---
INSERT INTO "users" ("name", "created_at", "updated_at", "type", "encrypted_password_iv", "user_name", "contact_no", "address", "email", "encrypted_password", "department_id") VALUES(NULL, '2020-05-22 05:53:09', '2020-05-22 05:53:09', 'Admin', NULL, 'kavikalai110@gmail.com', '1234567890', 'Main Street', 'kavikalai110@gmail.com', 'PaVSIkHLNmk1L3g9H4AQQQ==
SELECT * FROM "users" WHERE ( ("users"."type" = 'Admin' ) ) ORDER BY users.id DESC LIMIT 1

    def login
    	@user=User.find_by_user_name_and_password_and_status(params[:user_name],params[:password],true)
    	if @user.present?
---
SELECT * FROM "users" WHERE ( ("users"."type" = 'Admin' ) ) ORDER BY users.id DESC LIMIT 1

    def index
        if @current_user.type=='Admin'
         	@users = User.active.all
---
SELECT * FROM "users" WHERE ( ("users"."type" = 'Admin' ) ) ORDER BY users.id DESC LIMIT 1

    def update
        status = params[:user][:status]=='Active' ? true : false
    	@current_user.update_attributes(:password=>params[:user][:password],:contact_no=>params[:user][:contact_no],:address=>params[:user][:address],:status=>status)
        if @current_user.present? and @current_user.status==true
---
UPDATE "users" SET "updated_at" = '2020-05-26 04:32:48', "status" = NULL, "address" = '20''th streat' WHERE "id" = 3
SELECT * FROM "users" WHERE ("users"."status" = 't' AND "users"."id" IS NULL) LIMIT 1

    def user_update
        status = params[:user][:status]=='Active' ? true : false
        if @user.update_attributes(:password=>params[:user][:password],:contact_no=>params[:user][:contact_no],:address=>params[:user][:address],:status=>status)
---
UPDATE "users" SET "status" = 't', "updated_at" = '2020-05-28 10:14:48' WHERE "id" = 3

    def department
      @departments =Department.all
---
SELECT * FROM "departments"

    def create_department
      @department = Department.create!(:name=>params[:department],:created_by=>@current_user)
---
INSERT INTO "departments" ("name", "created_at", "status", "updated_at", "created_by") VALUES('Genaral', '2020-05-26 04:54:26', NULL, '2020-05-26 04:54:26', 1)

    def delete_department
    	@department = Department.find_by_id(params[:id])
    	if @department.destroy
---
SELECT * FROM "departments" WHERE ("departments"."id" = '2') LIMIT 1
DELETE FROM "departments" WHERE "id" = 2

    def assign_department
    	@departments = Department.all
---
SELECT * FROM "departments"

    def inactive_users
        @users = User.inactive.all
---
SELECT * FROM "users" WHERE (status ='f')

    def appointment_status
        @departments = Department.all
---
SELECT * FROM "departments"

    def department_wise_appointment
        @appointments = Appointment.all  :include=>[:doctor,:patient],:conditions=>['users.department_id=?',params[:department_id]]
---
SELECT * FROM "departments"

    def institutions
        @institution = Insititution.new
        @institutions = Insititution.all
---
SELECT * FROM "insititutions" ORDER BY insititutions.id DESC LIMIT 1

    def uploads
        @institution = Insititution.new(params[:upload])
        if @institution.save!
---
INSERT INTO "insititutions" ("updated_at", "image_file_size", "created_at", "image_updated_at", "image_file_name", "file_path", "insititution_name", "image_content_type") VALUES('2020-06-03 05:27:52', 60768, '2020-06-03 05:27:52', '2020-06-03 05:27:52', 'logo-removebg-preview_1_.png', NULL, 'Foradian', 'image/png')